# RebarShapeConstraint Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraint Properties
RebarShapeConstraint Class See Also
---
The RebarShapeConstraint type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RebarShapeConstraint Class
Autodesk.Revit.DB.Structure Namespace